RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F20x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f20x_fsmc.c
/*******************************************************************************
* Function Name  : FSMC_GetECC
* Description    : Returns the error correction code register value.
* Input          : FSMC_Bank: specifies the FSMC Bank to be used
*                    FSMC_Bank2_NAND: FSMC Bank2 NAND
*                    FSMC_Bank3_NAND: FSMC Bank3 NAND
*                  NewState£ºENABLE or DISABLE.
* Return         : eccval£ºThe Error Correction Code (ECC) value.
*******************************************************************************/
uint32_t FSMC_GetECC(uint32_t FSMC_Bank)
{
  uint32_t eccval = 0x00000000;
  
  if(FSMC_Bank == FSMC_Bank2_NAND)
  {
    eccval = FSMC_Bank2->ECCR2;
  }
  else
  {
    eccval = FSMC_Bank3->ECCR3;
  }
  return(eccval);
}

/*******************************************************************************
* Function Name  : FSMC_ITConfig
* Description    : Enables or disables the specified FSMC interrupts.
* Input          : FSMC_Bank: specifies the FSMC Bank to be used
*                    FSMC_Bank2_NAND: FSMC Bank2 NAND
*                    FSMC_Bank3_NAND: FSMC Bank3 NAND
*                    FSMC_Bank4_PCCARD: FSMC Bank4 PCCARD
*                  FSMC_IT: specifies the FSMC interrupt sources to be enabled or disabled.
*                    FSMC_IT_RisingEdge: Rising edge detection interrupt.
*                    FSMC_IT_Level: Level edge detection interrupt.
*                    FSMC_IT_FallingEdge: Falling edge detection interrupt.
*                  NewState£ºENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void FSMC_ITConfig(uint32_t FSMC_Bank, uint32_t FSMC_IT, FunctionalState NewState)
{
  
  if (NewState != DISABLE)
  {
    if(FSMC_Bank == FSMC_Bank2_NAND)
    {
      FSMC_Bank2->SR2 |= FSMC_IT;
    }
    else if (FSMC_Bank == FSMC_Bank3_NAND)
    {
      FSMC_Bank3->SR3 |= FSMC_IT;
    }
    else
    {
      FSMC_Bank4->SR4 |= FSMC_IT;    
    }
  }
  else
  {
    if(FSMC_Bank == FSMC_Bank2_NAND)
    {
      
      FSMC_Bank2->SR2 &= (uint32_t)~FSMC_IT;
    }
    else if (FSMC_Bank == FSMC_Bank3_NAND)
    {
      FSMC_Bank3->SR3 &= (uint32_t)~FSMC_IT;
    }
    else
    {
      FSMC_Bank4->SR4 &= (uint32_t)~FSMC_IT;    
    }
  }
}

/*******************************************************************************
* Function Name  : FSMC_GetFlagStatus
* Description    : Checks whether the specified FSMC flag is set or not.
* Input          : FSMC_Bank: specifies the FSMC Bank to be used
*                    FSMC_Bank2_NAND: FSMC Bank2 NAND
*                    FSMC_Bank3_NAND: FSMC Bank3 NAND
*                    FSMC_Bank4_PCCARD: FSMC Bank4 PCCARD
*                  FSMC_FLAG: specifies the flag to check.
*                    FSMC_FLAG_RisingEdge: Rising egde detection Flag.
*                    FSMC_FLAG_Level: Level detection Flag.
*                    FSMC_FLAG_FallingEdge: Falling egde detection Flag.
*                    FSMC_FLAG_FEMPT: Fifo empty Flag.
*                  NewState£ºENABLE or DISABLE.
* Return         : FlagStatus£º The new state of FSMC_FLAG (SET or RESET).
*******************************************************************************/
FlagStatus FSMC_GetFlagStatus(uint32_t FSMC_Bank, uint32_t FSMC_FLAG)
{
  FlagStatus bitstatus = RESET;
  uint32_t tmpsr = 0x00000000;
  
  
  if(FSMC_Bank == FSMC_Bank2_NAND)
  {
    tmpsr = FSMC_Bank2->SR2;
  }  
  else if(FSMC_Bank == FSMC_Bank3_NAND)
  {
    tmpsr = FSMC_Bank3->SR3;
  }
  else
  {
    tmpsr = FSMC_Bank4->SR4;
  } 
  
  if ((tmpsr & FSMC_FLAG) != (uint16_t)RESET )
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }

  return bitstatus;
}

/*******************************************************************************
* Function Name  : FSMC_ClearFlag
* Description    : Clears the FSMC's pending flags.
* Input          : FSMC_Bank: specifies the FSMC Bank to be used
*                    FSMC_Bank2_NAND: FSMC Bank2 NAND
*                    FSMC_Bank3_NAND: FSMC Bank3 NAND
*                    FSMC_Bank4_PCCARD: FSMC Bank4 PCCARD
*                  FSMC_FLAG: specifies the flag to check.
*                    FSMC_FLAG_RisingEdge: Rising egde detection Flag.
*                    FSMC_FLAG_Level: Level detection Flag.
*                    FSMC_FLAG_FallingEdge: Falling egde detection Flag.
* Return         : None.
*******************************************************************************/
void FSMC_ClearFlag(uint32_t FSMC_Bank, uint32_t FSMC_FLAG)
{
    
  if(FSMC_Bank == FSMC_Bank2_NAND)
  {
    FSMC_Bank2->SR2 &= ~FSMC_FLAG; 
  }  
  else if(FSMC_Bank == FSMC_Bank3_NAND)
  {
    FSMC_Bank3->SR3 &= ~FSMC_FLAG;
  }
  else
  {
    FSMC_Bank4->SR4 &= ~FSMC_FLAG;
  }
}

/*******************************************************************************
* Function Name  : FSMC_GetITStatus
* Description    : Checks whether the specified FSMC interrupt has occurred or not.
* Input          : FSMC_Bank: specifies the FSMC Bank to be used
*                    FSMC_Bank2_NAND: FSMC Bank2 NAND
*                    FSMC_Bank3_NAND: FSMC Bank3 NAND
*                    FSMC_Bank4_PCCARD: FSMC Bank4 PCCARD
*                  FSMC_IT: specifies the FSMC interrupt source to check.
*                    FSMC_IT_RisingEdge: Rising edge detection interrupt.
*                    FSMC_IT_Level: Level edge detection interrupt.
*                    FSMC_IT_FallingEdge: Falling edge detection interrupt.
* Return         : ITStatus£ºThe new state of FSMC_IT (SET or RESET).
*******************************************************************************/
ITStatus FSMC_GetITStatus(uint32_t FSMC_Bank, uint32_t FSMC_IT)
{
  ITStatus bitstatus = RESET;
  uint32_t tmpsr = 0x0, itstatus = 0x0, itenable = 0x0; 
  
  
  if(FSMC_Bank == FSMC_Bank2_NAND)
  {
    tmpsr = FSMC_Bank2->SR2;
  }  
  else if(FSMC_Bank == FSMC_Bank3_NAND)
  {
    tmpsr = FSMC_Bank3->SR3;
  }
  else
  {
    tmpsr = FSMC_Bank4->SR4;
  } 
  
  itstatus = tmpsr & FSMC_IT;
  
  itenable = tmpsr & (FSMC_IT >> 3);
  if ((itstatus != (uint32_t)RESET)  && (itenable != (uint32_t)RESET))
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }
  return bitstatus; 
}

/*******************************************************************************
* Function Name  : FSMC_ClearITPendingBit
* Description    : Clears the FSMC's interrupt pending bits.
* Input          : FSMC_Bank: specifies the FSMC Bank to be used
*                    FSMC_Bank2_NAND: FSMC Bank2 NAND
*                    FSMC_Bank3_NAND: FSMC Bank3 NAND
*                    FSMC_Bank4_PCCARD: FSMC Bank4 PCCARD
*                  FSMC_IT: specifies the FSMC interrupt source to check.
*                    FSMC_IT_RisingEdge: Rising edge detection interrupt.
*                    FSMC_IT_Level: Level edge detection interrupt.
*                    FSMC_IT_FallingEdge: Falling edge detection interrupt.
* Return         : None
*******************************************************************************/
void FSMC_ClearITPendingBit(uint32_t FSMC_Bank, uint32_t FSMC_IT)
{
    
  if(FSMC_Bank == FSMC_Bank2_NAND)
  {
    FSMC_Bank2->SR2 &= ~(FSMC_IT >> 3); 
  }  
  else if(FSMC_Bank == FSMC_Bank3_NAND)
  {
    FSMC_Bank3->SR3 &= ~(FSMC_IT >> 3);
  }
  else
  {
    FSMC_Bank4->SR4 &= ~(FSMC_IT >> 3);
  }
}
